app/Controllers/Barang.php

  public function index()
  {
    $model = new BarangModel();
    $data['barang'] = $model->findAll();
---
SELECT *
FROM `barang`