app/Models/UserModel.php

  public function getUser($login)
  {
    return $this->where('email', $login)
      ->orWhere('username', $login)
      ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'Admin#1'
OR `username` = 'Admin#1'
 LIMIT 1